# Taps
tap 'homebrew/bundle' # To be able to use run `brew bundle` to install all apps - https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53
tap 'oven-sh/bun'

# Binaries
brew 'aria2' # Download utility
brew 'b2-tools' # Backblaze storage CLI
brew 'bat' # Improved cat command
brew 'dsully/homebrew-tap/macos-defaults' # Manage macOS defaults declaratively via YAML files
brew 'fish' # Fish shell 
brew 'fswatch' # Run command whenever files change
brew 'htop' # Better process monitor
brew 'mas' # Mac App Store manager (https://github.com/mas-cli/mas)
brew 'rename' # Batch renamer
brew 'unison' # Sync tool
brew 'watch' # Watch a command's output changes over time
brew 'wget' # Download files from the web
# brew 'jq' # JSON parser
# brew 'mackup' # Backup and restore app settings on macOS
# brew 'tree' # Display directories as trees 
# brew 'ncdu' # Disk usage analyzer

# Development
brew 'bun' # node alternative / JavaScript runtime
brew 'httpie' # API testing client
brew 'openssl'
# brew 'pngquant' # Image compression
# brew 'oxipng' # Image compression
# brew 'grpcurl' # gRPC testing tool for CLI
# brew 'imagemagick' # Image processing library
# brew 'gh' # GitHub CLI
# brew 'git'
# brew 'direnv' # Load/unload environment variables based on current directory
# brew 'pyenv' # Python version manager
# cask 'adoptopenjdk' # Java JDK
# brew 'jpeg'
# brew 'libjpeg'
# brew 'libpng'
# brew 'libxtiff'
# brew 'libyaml'


# Apps
cask '1password' # Password manager
cask '1password-cli'
cask 'adobe-acrobat-reader'
# cask 'backblaze' # Backup files to the cloud
cask 'brave-browser' # Web browser
cask 'cleanmymac' # Tool to remove unnecessary files and folders from disk
cask 'crossover' # Windows emulator
# cask 'devcleaner' # Remove Xcode caches and unused simulators
# cask 'discord'
# cask 'docker'
cask 'firefox' # Web browser
cask 'flux' # Blue light reducer (night mode)
cask 'gog-galaxy' # Game client
cask 'google-chrome' # Web browser
cask 'grammarly-desktop' # Utility to fix grammar errors and style issues in text
cask 'handbrake' # Open-source video transcoder
cask 'hex-fiend' # Hex editor
cask 'httpie' # Testing client for REST, GraphQL, and HTTP APIs
cask 'iina' # Free and open-source media player
cask 'image2icon' # Icon creator and file and folder customiser
cask 'imageoptim' # Tool to optimise images to a smaller size
cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'messenger' # Meta Messenger (formerly Facebook)
cask 'microsoft-excel' # Microsoft Office
cask 'microsoft-word' # Microsoft Office
cask 'namechanger' # Rename a list of files quickly
cask 'parallels@18' # Parallels Desktop (virtualization software) [NB. Needs full disk access]
cask 'piezo' # Audio recording application
cask 'pdf-squeezer' # PDF compression tool
cask 'prefs-editor' # Graphical user interface for the 'defaults' command
cask 'proton-drive' # Client for Proton Drive
cask 'proton-mail' # Client for Proton Mail
cask 'protonvpn' # VPN client
cask 'rectangle' # Window manager
cask 'skype' # Video chat, voice call and instant messaging application
cask 'sourcetree' # Graphical client for Git version control
cask 'spotify' # Music player/streamer
cask 'steam' # Video game digital distribution service
cask 'sublime-text' # Text editor for code, markup and prose
cask 'suspicious-package' # Application for inspecting installer packages
cask 'the-unarchiver' # Decompression util
cask 'transmission' # Open-source BitTorrent client
cask 'visual-studio-code' 
cask 'vlc' # Multimedia player 
cask 'whatsapp' # Messaging client
cask 'youtube-to-mp3' # Downloads music from playlists or channels
cask 'zoom' # Video communication and virtual meeting platform

# Quicklook
# cask 'qlmarkdown' # $ xattr -r -d com.apple.quarantine "FULL PATH OF THE QLMarkdown.app (you can drag the file to get the pull path)" - https://github.com/sbarex/QLMarkdown
# cask 'quicklook-json'
# cask 'quicklook-csv'

# Mac App Store (https://github.com/mas-cli/mas)
# mas 'AssetDash', id: 937984704 # Crypto portfolio manager
mas 'Affinity Photo', id: 824183456 # Photo editing
mas 'Affinity Publisher', id: 881418622 # Page layout design
mas 'Marked 2', id: 890031187 # Markdown preview
mas 'New File Here', id: 777221999 # Create new file from context menu
mas 'New Terminal Here', id: 1067646949 # Open terminal from context menu
mas 'TunesMechanic', id: 1259223205 # Remove dupliate tracks from iTunes library
mas 'Xcode', id: 497799835